KitSprout/MultimeterPen/firmware/Program/drivers/stm32l0_i2cSimu.c
/**
 *      __            ____
 *     / /__ _  __   / __/                      __  
 *    / //_/(_)/ /_ / /  ___   ____ ___  __ __ / /_ 
 *   / ,<  / // __/_\ \ / _ \ / __// _ \/ // // __/ 
 *  /_/|_|/_/ \__//___// .__//_/   \___/\_,_/ \__/  
 *                    /_/   github.com/KitSprout    
 *  
 *  @file    stm32f0_i2cSimu.c
 *  @author  KitSprout
 *  @brief   
 * 
 */

/* Includes --------------------------------------------------------------------------------*/
#include "stm32l0_i2cSimu.h"

/* Define ----------------------------------------------------------------------------------*/
/* Macro -----------------------------------------------------------------------------------*/

#define I2CxS_SCL_L()               __GPIO_RST(pSimuI2c->PortSCL, pSimuI2c->PinSCL)
#define I2CxS_SCL_H()               __GPIO_SET(pSimuI2c->PortSCL, pSimuI2c->PinSCL)
#define I2CxS_SCL_READ()            (__GPIO_READ(pSimuI2c->PortSCL, pSimuI2c->PinSCL) == pSimuI2c->PinSCL)

#define I2CxS_SDA_L()               __GPIO_RST(pSimuI2c->PortSDA, pSimuI2c->PinSDA)
#define I2CxS_SDA_H()               __GPIO_SET(pSimuI2c->PortSDA, pSimuI2c->PinSDA)
#define I2CxS_SDA_READ()            (__GPIO_READ(pSimuI2c->PortSDA, pSimuI2c->PinSDA) == pSimuI2c->PinSDA)

/* Typedef ---------------------------------------------------------------------------------*/
/* Variables -------------------------------------------------------------------------------*/
/* Prototypes ------------------------------------------------------------------------------*/
/* Functions -------------------------------------------------------------------------------*/

/**
 *  @brief  SimuI2C_Config
 */
void SimuI2C_Config( SimuI2C_InitTypeDef *pSimuI2c )
{
    GPIO_InitTypeDef GPIO_InitStruct; 

    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

    GPIO_InitStruct.Pin   = pSimuI2c->PinSCL;
    HAL_GPIO_Init(pSimuI2c->PortSCL, &GPIO_InitStruct);

    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_OD;
    GPIO_InitStruct.Pull  = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

    GPIO_InitStruct.Pin   = pSimuI2c->PinSDA;
    HAL_GPIO_Init(pSimuI2c->PortSDA, &GPIO_InitStruct);

    I2CxS_SCL_H();
    I2CxS_SDA_H();
}

/**
 *  @brief  SimuI2C_Delay
 */
static void SimuI2C_Delay( SimuI2C_InitTypeDef *pSimuI2c )
{
    uint32_t count = pSimuI2c->Frequency;

    while (count--)
    {
        __nop();
    }
}

/**
 *  @brief  SimuI2C_Start
 */
void SimuI2C_Start( SimuI2C_InitTypeDef *pSimuI2c )
{
    I2CxS_SDA_H();
    I2CxS_SCL_H();
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SDA_L();
    SimuI2C_Delay(pSimuI2c);
}

/**
 *  @brief  SimuI2C_Stop
 */
void SimuI2C_Stop( SimuI2C_InitTypeDef *pSimuI2c )
{
    I2CxS_SDA_L();
    I2CxS_SCL_H();
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SDA_H();
    SimuI2C_Delay(pSimuI2c);
}

/**
 *  @brief  SimuI2C_SendACK
 */
void SimuI2C_SendACK( SimuI2C_InitTypeDef *pSimuI2c, const uint32_t ack )
{
    I2CxS_SCL_L();
    if (ack)
    {
        I2CxS_SDA_H();
    }
    else
    {
        I2CxS_SDA_L();
    }
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SCL_H();
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SCL_L();
    SimuI2C_Delay(pSimuI2c);
}

/**
 *  @brief  SimuI2C_RecvACK
 */
uint32_t SimuI2C_RecvACK( SimuI2C_InitTypeDef *pSimuI2c )
{
    uint32_t ack;

    I2CxS_SCL_L();
    I2CxS_SDA_H();
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SCL_H();
    SimuI2C_Delay(pSimuI2c);
    ack = I2CxS_SDA_READ();
    I2CxS_SCL_L();
    SimuI2C_Delay(pSimuI2c);

    return ack;
}

/**
 *  @brief  SimuI2C_SendByte
 */
void SimuI2C_SendByte( SimuI2C_InitTypeDef *pSimuI2c, uint8_t sendByte )
{
    uint32_t cnt = 8;

    while (cnt--)
    {
        I2CxS_SCL_L();
        SimuI2C_Delay(pSimuI2c);
        if (sendByte & 0x80)  // MSB First
        {
            I2CxS_SDA_H();
        }
        else
        {
            I2CxS_SDA_L();
        }
        sendByte = sendByte << 1;
        SimuI2C_Delay(pSimuI2c);
        I2CxS_SCL_H();
        SimuI2C_Delay(pSimuI2c);
    }
    I2CxS_SCL_L();
}

/**
 *  @brief  SimuI2C_RecvByte
 */
uint8_t SimuI2C_RecvByte( SimuI2C_InitTypeDef *pSimuI2c )
{
    uint32_t cnt = 8;
    uint8_t recvByte = 0;

    I2CxS_SDA_H();
    while (cnt--)
    {
        recvByte = recvByte << 1;
        I2CxS_SCL_L();
        SimuI2C_Delay(pSimuI2c);
        I2CxS_SCL_H();
        SimuI2C_Delay(pSimuI2c);
        if (I2CxS_SDA_READ())
        {
            recvByte |= 0x01;
        }
    }
    I2CxS_SCL_L();

    return recvByte;
}

/**
 *  @brief  SimuI2C_SendBytes
 */
void SimuI2C_SendBytes( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t *sendBytes, const uint32_t lens )
{
    uint32_t i, cnt;
    uint8_t sendByte;

    for (i = 0; i < lens; i++)
    {
        sendByte = *(sendBytes++);
        cnt = 8;
        while (cnt--)
        {
            I2CxS_SCL_L();
            SimuI2C_Delay(pSimuI2c);
            if (sendByte & 0x80)  // MSB First
            {
                I2CxS_SDA_H();
            }
            else
            {
                I2CxS_SDA_L();
            }
            sendByte = sendByte << 1;
            SimuI2C_Delay(pSimuI2c);
            I2CxS_SCL_H();
            SimuI2C_Delay(pSimuI2c);
        }
    }
    I2CxS_SCL_L();
}

/**
 *  @brief  SimuI2C_RecvBytes
 */
void SimuI2C_RecvBytes( SimuI2C_InitTypeDef *pSimuI2c, uint8_t *recvBytes, const uint32_t lens )
{
    uint32_t i, cnt;
    uint8_t recvByte;

    I2CxS_SDA_H();
    for (i = 0; i < lens; i++)
    {
        cnt = 8;
        recvByte = 0;
        while (cnt--)
        {
            recvByte = recvByte << 1;
            I2CxS_SCL_L();
            SimuI2C_Delay(pSimuI2c);
            I2CxS_SCL_H();
            SimuI2C_Delay(pSimuI2c);
            if (I2CxS_SDA_READ())
            {
                recvByte |= 0x01;
            }
        }
        *(recvBytes++) = recvByte;
    }

    I2CxS_SCL_L();
}

/**
 *  @brief  SimuI2C_BeginTransmission
 */
uint32_t SimuI2C_BeginTransmission( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t sendbyte )
{
    SimuI2C_Start(pSimuI2c);
    return (SimuI2C_SendByteAck(pSimuI2c, sendbyte) != SIMUI2C_ACK) ? KS_ERROR : KS_OK;
}

/**
 *  @brief  SimuI2C_EndTransmission
 */
void SimuI2C_EndTransmission( SimuI2C_InitTypeDef *pSimuI2c )
{
    I2CxS_SDA_L();
    I2CxS_SCL_H();
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SDA_H();
    SimuI2C_Delay(pSimuI2c);
}

/**
 *  @brief  SimuI2C_SendByteAck
 */
uint32_t SimuI2C_SendByteAck( SimuI2C_InitTypeDef *pSimuI2c, uint8_t sendByte )
{
    uint32_t cnt = 8;
    uint32_t ack;

    while (cnt--)
    {
        I2CxS_SCL_L();
        SimuI2C_Delay(pSimuI2c);
        if (sendByte & 0x80)  // MSB First
        {
            I2CxS_SDA_H();
        }
        else
        {
            I2CxS_SDA_L();
        }
        sendByte = sendByte << 1;
        SimuI2C_Delay(pSimuI2c);
        I2CxS_SCL_H();
        SimuI2C_Delay(pSimuI2c);
    }
    I2CxS_SCL_L();
    I2CxS_SDA_H();
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SCL_H();
    SimuI2C_Delay(pSimuI2c);
    ack = I2CxS_SDA_READ();
    I2CxS_SCL_L();
    SimuI2C_Delay(pSimuI2c);

