KitSprout/MultimeterPen/firmware/Program/drivers/stm32l0_i2cSimu.c
    return ack;
}

/**
 *  @brief  SimuI2C_RecvByteAck
 */
uint8_t SimuI2C_RecvByteAck( SimuI2C_InitTypeDef *pSimuI2c, const uint32_t ack )
{
    uint32_t cnt = 8;
    uint8_t recvByte = 0;

    I2CxS_SDA_H();
    while (cnt--)
    {
        I2CxS_SCL_L();
        SimuI2C_Delay(pSimuI2c);
        recvByte = recvByte << 1;
        I2CxS_SCL_H();
        SimuI2C_Delay(pSimuI2c);
        if (I2CxS_SDA_READ())
        {
            recvByte |= 0x01;
        }
    }
    I2CxS_SCL_L();
    if (ack)
    {
        I2CxS_SDA_H();
    }
    else
    {
        I2CxS_SDA_L();
    }
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SCL_H();
    SimuI2C_Delay(pSimuI2c);
    I2CxS_SCL_L();
    SimuI2C_Delay(pSimuI2c);

    return recvByte;
}

/**
 *  @brief  SimuI2C_SendBytesAck
 */
uint32_t SimuI2C_SendBytesAck( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t *sendBytes, const uint32_t lens )
{
    uint32_t i, cnt;
    uint32_t ack;
    uint8_t sendByte;

    for (i = 0; i < lens; i++)
    {
        sendByte = *(sendBytes++);
        cnt = 8;
        while (cnt--)
        {
            I2CxS_SCL_L();
            SimuI2C_Delay(pSimuI2c);
            if (sendByte & 0x80)  // MSB First
            {
                I2CxS_SDA_H();
            }
            else
            {
                I2CxS_SDA_L();
            }
            sendByte = sendByte << 1;
            SimuI2C_Delay(pSimuI2c);
            I2CxS_SCL_H();
            SimuI2C_Delay(pSimuI2c);
        }
        I2CxS_SCL_L();
        I2CxS_SDA_H();
        SimuI2C_Delay(pSimuI2c);
        I2CxS_SCL_H();
        SimuI2C_Delay(pSimuI2c);
        ack = I2CxS_SDA_READ();
        if (ack != SIMUI2C_ACK)
        {
            return KS_ERROR;
        }
    }
    I2CxS_SCL_L();
    return KS_OK;
}

/**
 *  @brief  SimuI2C_RecvBytesAck
 */
void SimuI2C_RecvBytesAck( SimuI2C_InitTypeDef *pSimuI2c, uint8_t *recvBytes, const uint32_t lens )
{
    uint32_t i, cnt;
    uint8_t recvByte;

    for (i = 0; i < lens; i++)
    {
        I2CxS_SDA_H();
        cnt = 8;
        recvByte = 0;
        while (cnt--)
        {
            I2CxS_SCL_L();
            SimuI2C_Delay(pSimuI2c);
            recvByte = recvByte << 1;
            I2CxS_SCL_H();
            SimuI2C_Delay(pSimuI2c);
            if (I2CxS_SDA_READ())
            {
                recvByte |= 0x01;
            }
        }
        I2CxS_SCL_L();
        *(recvBytes++) = recvByte;
        if (i == (lens - 1))    // last data send NACK
        {
            I2CxS_SDA_H();
        }
        else
        {
            I2CxS_SDA_L();
        }
        SimuI2C_Delay(pSimuI2c);
        I2CxS_SCL_H();
        SimuI2C_Delay(pSimuI2c);
    }
    I2CxS_SCL_L();
}

/**
 *  @brief  SimuI2C_WriteData
 */
uint32_t SimuI2C_WriteData( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, const uint8_t writeData )
{
    uint8_t address8bit = slaveAddr << 1;

#if 1
#if ENABLE_ACK_CHECK
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_SendByteAck(pSimuI2c, writeData) != SIMUI2C_ACK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    SimuI2C_EndTransmission(pSimuI2c);
#else
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_SendByteAck(pSimuI2c, writeData);
    SimuI2C_EndTransmission(pSimuI2c);
#endif
#else
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, writeData);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_Stop(pSimuI2c);
#endif
    return KS_OK;
}

/**
 *  @brief  SimuI2C_ReadData
 */
uint32_t SimuI2C_ReadData( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, uint8_t *readData )
{
    uint8_t address8bit = slaveAddr << 1;
#if 1
#if ENABLE_ACK_CHECK
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_READ) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    *readData = SimuI2C_RecvByteAck(pSimuI2c, SIMUI2C_NACK);
    SimuI2C_EndTransmission(pSimuI2c);
#else
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_READ);
    *readData = SimuI2C_RecvByteAck(pSimuI2c, SIMUI2C_NACK);
    SimuI2C_EndTransmission(pSimuI2c);
#endif
#else
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_READ);
    SimuI2C_RecvACK(pSimuI2c);
    *readData = SimuI2C_RecvByte(pSimuI2c);
    SimuI2C_SendACK(pSimuI2c, SIMUI2C_NACK);
    SimuI2C_Stop(pSimuI2c);
#endif
    return KS_OK;
}

/**
 *  @brief  SimuI2C_WriteDatas
 */
uint32_t SimuI2C_WriteDatas( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, const uint8_t *writeData, const uint32_t lens )
{
    uint8_t address8bit = slaveAddr << 1;
#if 1
#if ENABLE_ACK_CHECK
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_SendBytesAck(pSimuI2c, writeData, lens) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    SimuI2C_EndTransmission(pSimuI2c);
#else
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_SendBytesAck(pSimuI2c, writeData, lens);
    SimuI2C_EndTransmission(pSimuI2c);
#endif
#else
    uint32_t cnt = lens;
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_RecvACK(pSimuI2c);
    while (cnt--)
    {
        SimuI2C_SendByte(pSimuI2c, *(writeData++));
        SimuI2C_RecvACK(pSimuI2c);
    }
    SimuI2C_Stop(pSimuI2c);
#endif
    return KS_OK;
}

/**
 *  @brief  SimuI2C_ReadDatas
 */
uint32_t SimuI2C_ReadDatas( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, uint8_t *readData, const uint32_t lens )
{
    uint8_t address8bit = slaveAddr << 1;
#if 1
#if ENABLE_ACK_CHECK
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_READ) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    SimuI2C_RecvBytesAck(pSimuI2c, readData, lens);
    SimuI2C_EndTransmission(pSimuI2c);
#else
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_READ);
    SimuI2C_RecvBytesAck(pSimuI2c, readData, lens);
    SimuI2C_EndTransmission(pSimuI2c);
#endif
#else
    uint32_t cnt = lens;
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_READ);
    SimuI2C_RecvACK(pSimuI2c);
    while (cnt--)
    {
        *(readData++) = SimuI2C_RecvByte(pSimuI2c);
        if (cnt)
        {
            SimuI2C_SendACK(pSimuI2c, SIMUI2C_ACK);
        }
        else
        {
            SimuI2C_SendACK(pSimuI2c, SIMUI2C_NACK);
        }
    }
    SimuI2C_Stop(pSimuI2c);
#endif
    return KS_OK;
}

/**
 *  @brief  SimuI2C_WriteReg
 */
uint32_t SimuI2C_WriteReg( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, const uint8_t regAddr, const uint8_t regData )
{
    uint8_t address8bit = slaveAddr << 1;
#if 1
#if ENABLE_ACK_CHECK
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_SendByteAck(pSimuI2c, regAddr) != SIMUI2C_ACK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_SendByteAck(pSimuI2c, regData) != SIMUI2C_ACK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    SimuI2C_EndTransmission(pSimuI2c);
#else
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_SendByteAck(pSimuI2c, regAddr);
    SimuI2C_SendByteAck(pSimuI2c, regData);
    SimuI2C_EndTransmission(pSimuI2c);
#endif
#else
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, regAddr);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, regData);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_Stop(pSimuI2c);
#endif
    return KS_OK;
}

/**
 *  @brief  SimuI2C_ReadReg
 */
uint32_t SimuI2C_ReadReg( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, const uint8_t regAddr, uint8_t *regData )
{
    uint8_t address8bit = slaveAddr << 1;
#if 1
#if ENABLE_ACK_CHECK
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_SendByteAck(pSimuI2c, regAddr) != SIMUI2C_ACK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_READ) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    *regData = SimuI2C_RecvByteAck(pSimuI2c, SIMUI2C_NACK);
    SimuI2C_EndTransmission(pSimuI2c);
#else
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_SendByteAck(pSimuI2c, regAddr);
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_READ);
    *regData = SimuI2C_RecvByteAck(pSimuI2c, SIMUI2C_NACK);
    SimuI2C_EndTransmission(pSimuI2c);
#endif
#else
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, regAddr);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_READ);
    SimuI2C_RecvACK(pSimuI2c);
    *regData = SimuI2C_RecvByte(pSimuI2c);
    SimuI2C_SendACK(pSimuI2c, NACK);
    SimuI2C_Stop(pSimuI2c);
#endif
    return KS_OK;
}

/**
 *  @brief  SimuI2C_WriteRegs
 */
uint32_t SimuI2C_WriteRegs( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, const uint8_t regAddr, const uint8_t *regData, const uint32_t lens )
{
    uint8_t address8bit = slaveAddr << 1;
#if 1
#if ENABLE_ACK_CHECK
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_SendByteAck(pSimuI2c, regAddr) != SIMUI2C_ACK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_SendBytesAck(pSimuI2c, regData, lens) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    SimuI2C_EndTransmission(pSimuI2c);
#else
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_SendByteAck(pSimuI2c, regAddr);
    SimuI2C_SendBytesAck(pSimuI2c, regData, lens);
    SimuI2C_EndTransmission(pSimuI2c);
#endif
#else
    uint32_t cnt = lens;
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, regAddr);
    SimuI2C_RecvACK(pSimuI2c);
    while (cnt--)
    {
        SimuI2C_SendByte(pSimuI2c, *(regData++));
        SimuI2C_RecvACK(pSimuI2c);
    }
    SimuI2C_Stop(pSimuI2c);
#endif
    return KS_OK;
}

/**
 *  @brief  SimuI2C_ReadRegs
 */
uint32_t SimuI2C_ReadRegs( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, const uint8_t regAddr, uint8_t *regData, const uint32_t lens )
{
    uint8_t address8bit = slaveAddr << 1;
#if 1
#if ENABLE_ACK_CHECK
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_SendByteAck(pSimuI2c, regAddr) != SIMUI2C_ACK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    if (SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_READ) != KS_OK)
    {
        SimuI2C_EndTransmission(pSimuI2c);
        return KS_ERROR;
    }
    SimuI2C_RecvBytesAck(pSimuI2c, regData, lens);
    SimuI2C_EndTransmission(pSimuI2c);
#else
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_SendByteAck(pSimuI2c, regAddr);
    SimuI2C_BeginTransmission(pSimuI2c, address8bit | SIMUI2C_READ);
    SimuI2C_RecvBytesAck(pSimuI2c, regData, lens);
    SimuI2C_EndTransmission(pSimuI2c);
#endif
#else
    uint32_t cnt = lens;
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_WRITE);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, regAddr);
    SimuI2C_RecvACK(pSimuI2c);
    SimuI2C_Start(pSimuI2c);
    SimuI2C_SendByte(pSimuI2c, address8bit | SIMUI2C_READ);
    SimuI2C_RecvACK(pSimuI2c);
    while (cnt--)
    {
        *(regData++) = SimuI2C_RecvByte(pSimuI2c);
        if (cnt)
        {
            SimuI2C_SendACK(pSimuI2c, SIMUI2C_ACK);
        }
        else
        {
            SimuI2C_SendACK(pSimuI2c, SIMUI2C_NACK);
        }
    }
    SimuI2C_Stop(pSimuI2c);
#endif
    return KS_OK;
}

/**
 *  @brief  SimuI2C_ScanDevice
 */
uint32_t SimuI2C_ScanDevice( SimuI2C_InitTypeDef *pSimuI2c, uint8_t *devAddress )
{
    uint32_t status;
    uint32_t idx = 0;

    SimuI2C_EndTransmission(pSimuI2c);
    for (uint32_t i = 0; i < 128; i++)
    {
        status = SimuI2C_BeginTransmission(pSimuI2c, i << 1);
        SimuI2C_EndTransmission(pSimuI2c);
        if (status == KS_OK)
        {
            devAddress[idx++] = i;
        }
        else
        {
            devAddress[i] = 0;
        }
    }

