KitSprout/MultimeterPen/firmware/Program/drivers/stm32l0_i2cSimu.c
#if 0
    klogc("\n");
    klogc(" >>  i2c device scanner (found %d)\n\n", idx);
    klogc("      0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F");
    idx = 0;
    for (uint32_t i = 0; i < 128; i++)
    {
        if (i % 16 == 0)
        {
           klogc("\n %02X:", i);
        }
        if (i == devAddress[idx])
        {
            idx++;
            klogc(" %02X", i);
        }
        else
        {
            klogc(" --");
        }
    }
    klogc("\n\n");
    klogc(NULL);
#endif

    return idx;
}

/**
 *  @brief  SimuI2C_ScanRegs
 */
#define MULTIBYTEREAD    (8U)
uint32_t SimuI2C_ScanRegs( SimuI2C_InitTypeDef *pSimuI2c, const uint8_t slaveAddr, uint8_t *regData )
{
    uint32_t status;

    SimuI2C_EndTransmission(pSimuI2c);
    status = SimuI2C_BeginTransmission(pSimuI2c, slaveAddr << 1);
    SimuI2C_EndTransmission(pSimuI2c);

    if (status == KS_OK)
    {
        for (uint32_t i = 0; i < 256; i = i + MULTIBYTEREAD)
        {
            SimuI2C_ReadRegs(pSimuI2c, slaveAddr, i, &regData[i], MULTIBYTEREAD);
        }
    }

#if 0
    klogc("\n");
    klogc(" >>  i2c device register (address 0x%02X)\n\n", slaveAddr);
    klogc("      0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F");
    for (uint32_t i = 0; i < 256; i++)
    {
        if (i % 16 == 0)
        {
            klogc("\n %02X:", i);
        }
        klogc(" %02X", regData[i]);
    }
    klogc("\n\n");
    klogc(NULL);
#endif

    return status;
}

#if 1
/**
 *  @brief  SimuI2C_ScanDeviceGPIO
 */
uint32_t SimuI2C_ScanDeviceGPIO( const uint8_t sclpin, GPIO_TypeDef *sclport, const uint8_t sdapin, GPIO_TypeDef *sdaport, uint8_t *devAddress )
{
    uint8_t devCount;
    SimuI2C_InitTypeDef i2c =
    {
        .PinSCL     = sclpin,
        .PortSCL    = sclport,
        .PinSDA     = sdapin,
        .PortSDA    = sdaport,
        .Frequency  = SIMUI2C_DEFAULT_FREQ
    };
    SimuI2C_Config(&i2c);
    devCount = SimuI2C_ScanDevice(&i2c, devAddress);

#if 0
    klogc("\n");
    klogc(" >>  i2c device scanner (found %d)\n\n", devCount);
    klogc("      0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F");
    devCount = 0;
    for (uint32_t i = 0; i < 128; i++)
    {
        if (i % 16 == 0)
        {
           klogc("\n %02X:", i);
        }
        if (i == devAddress[devCount])
        {
            devCount++;
            klogc(" %02X", i);
        }
        else
        {
            klogc(" --");
        }
    }
    klogc("\n\n");
    klogc(NULL);
#endif

    return devCount;
}

/**
 *  @brief  SimuI2C_ScanRegsGPIO
 */
uint32_t SimuI2C_ScanRegsGPIO( const uint8_t sclpin, GPIO_TypeDef *sclport, const uint8_t sdapin, GPIO_TypeDef *sdaport, const uint8_t slaveAddr, uint8_t *regData )
{
    uint8_t status;
    SimuI2C_InitTypeDef i2c =
    {
        .PinSCL     = sclpin,
        .PortSCL    = sclport,
        .PinSDA     = sdapin,
        .PortSDA    = sdaport,
        .Frequency  = SIMUI2C_DEFAULT_FREQ
    };
    SimuI2C_Config(&i2c);
    status = SimuI2C_ScanRegs(&i2c, slaveAddr, regData);

#if 0
    klogc("\n");
    klogc(" >>  i2c device register (address 0x%02X)\n\n", slaveAddr);
    klogc("      0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F");
    for (uint32_t i = 0; i < 256; i++)
    {
        if (i % 16 == 0)
        {
            klogc("\n %02X:", i);
        }
        klogc(" %02X", regData[i]);
    }
    klogc("\n\n");
    klogc(NULL);
#endif

    return status;
}

/**
 *  @brief  SimuI2C_ScanAllGPIO
 */
void SimuI2C_ScanAllGPIO( const uint8_t sclpin, GPIO_TypeDef *sclport, const uint8_t sdapin, GPIO_TypeDef *sdaport )
{
    uint8_t slaveAddr[128] = {0};
    uint8_t regData[256] = {0};
    uint8_t devCount;

    SimuI2C_InitTypeDef i2c =
    {
        .PinSCL     = sclpin,
        .PortSCL    = sclport,
        .PinSDA     = sdapin,
        .PortSDA    = sdaport,
        .Frequency  = SIMUI2C_DEFAULT_FREQ
    };
    SimuI2C_Config(&i2c);

    devCount = SimuI2C_ScanDevice(&i2c, slaveAddr);
#if 0
    klogc("\n");
    klogc(" >>  i2c device scanner (found %d)\n\n", devCount);
    klogc("      0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F");
    devCount = 0;
    for (uint32_t i = 0; i < 128; i++)
    {
        if (i % 16 == 0)
        {
           klogc("\n %02X:", i);
        }
        if (i == devAddress[devCount])
        {
            devCount++;
            klogc(" %02X", i);
        }
        else
        {
            klogc(" --");
        }
    }
    klogc("\n\n");
    klogc(NULL);
#endif
    for (uint32_t i = 0; i < devCount; i++)
    {
        SimuI2C_ScanRegs(&i2c, slaveAddr[i], regData);
#if 0
        klogc("\n");
        klogc(" >>  i2c device register (address 0x%02X)\n\n", slaveAddr);
        klogc("      0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F");
        for (uint32_t i = 0; i < 256; i++)
        {
            if (i % 16 == 0)
            {
                klogc("\n %02X:", i);
            }
            klogc(" %02X", regData[i]);
        }
        klogc("\n\n");
        klogc(NULL);
#endif
    }
}
#endif

/*************************************** END OF FILE ****************************************/
